Revit 2026 API

# FamilyInstanceCreationDataAxis Property

---

Get or set the axis of the FamilyInstance

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Line Axis { get; set; }
```
```vb
Public Property Axis As Line
	Get
	Set
```
```cpp
public:
property Line^ Axis {
	Line^ get ();
	void set (Line^ value);
}
```
```fsharp
member Axis : Line with get, set
```

#### Property Value

Line

The element property will be the axis while performing the rotation.

#### Reference

FamilyInstanceCreationData Class

Autodesk.Revit.Creation Namespace